7767517
43 50
Input                    data                     0 1 data -23330=4,3,256,256,3 0=256 1=256 2=3
Convolution              0_28                     1 1 data 0_28_bn_leaky -23330=4,3,256,256,16 0=16 1=3 4=1 5=1 6=432 9=2 -23310=1,1.000000e-01
Pooling                  1_36                     1 1 0_28_bn_leaky 1_36 -23330=4,3,128,128,16 1=2 2=2 5=1
Convolution              2_40                     1 1 1_36 2_40_bn_leaky -23330=4,3,128,128,32 0=32 1=1 5=1 6=512 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     3_48                     1 1 2_40_bn_leaky 3_48_bn_leaky -23330=4,3,128,128,32 0=32 1=3 4=1 5=1 6=288 7=32 9=2 -23310=1,1.000000e-01
Pooling                  4_57                     1 1 3_48_bn_leaky 4_57 -23330=4,3,64,64,32 1=2 2=2 5=1
Convolution              5_61                     1 1 4_57 5_61_bn_leaky -23330=4,3,64,64,64 0=64 1=1 5=1 6=2048 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     6_69                     1 1 5_61_bn_leaky 6_69_bn_leaky -23330=4,3,64,64,64 0=64 1=3 4=1 5=1 6=576 7=64 9=2 -23310=1,1.000000e-01
Pooling                  7_78                     1 1 6_69_bn_leaky 7_78 -23330=4,3,32,32,64 1=2 2=2 5=1
Convolution              8_82                     1 1 7_78 8_82_bn_leaky -23330=4,3,32,32,128 0=128 1=1 5=1 6=8192 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     9_90                     1 1 8_82_bn_leaky 9_90_bn_leaky -23330=4,3,32,32,128 0=128 1=3 4=1 5=1 6=1152 7=128 9=2 -23310=1,1.000000e-01
Split                    9_90_bn_leaky_split      1 2 9_90_bn_leaky 9_90_bn_leaky_split_0 9_90_bn_leaky_split_1 -23330=8,3,32,32,128,3,32,32,128
Pooling                  10_100                   1 1 9_90_bn_leaky_split_0 10_100 -23330=4,3,16,16,128 1=2 2=2 5=1
Convolution              11_104                   1 1 10_100 11_104_bn_leaky -23330=4,3,16,16,256 0=256 1=1 5=1 6=32768 9=2 -23310=1,1.000000e-01
ConvolutionDepthWise     12_112                   1 1 11_104_bn_leaky 12_112_bn_leaky -23330=4,3,16,16,256 0=256 1=3 4=1 5=1 6=2304 7=256 9=2 -23310=1,1.000000e-01
Split                    12_112_bn_leaky_split    1 2 12_112_bn_leaky 12_112_bn_leaky_split_0 12_112_bn_leaky_split_1 -23330=8,3,16,16,256,3,16,16,256
Pooling                  13_121                   1 1 12_112_bn_leaky_split_0 13_121 -23330=4,3,8,8,256 1=2 2=2 5=1
Convolution              14_125                   1 1 13_121 14_125_bn_leaky -23330=4,3,8,8,256 0=256 1=1 5=1 6=65536 9=2 -23310=1,1.000000e-01
Split                    14_125_bn_leaky_split    1 4 14_125_bn_leaky 14_125_bn_leaky_split_0 14_125_bn_leaky_split_1 14_125_bn_leaky_split_2 14_125_bn_leaky_split_3 -23330=16,3,8,8,256,3,8,8,256,3,8,8,256,3,8,8,256
Pooling                  15_134                   1 1 14_125_bn_leaky_split_0 15_134 -23330=4,3,8,8,256 1=5 3=2 5=1
Pooling                  17_141                   1 1 14_125_bn_leaky_split_1 17_141 -23330=4,3,8,8,256 1=9 3=4 5=1
Pooling                  19_148                   1 1 14_125_bn_leaky_split_2 19_148 -23330=4,3,8,8,256 1=13 3=6 5=1
Concat                   20_152                   4 1 19_148 17_141 15_134 14_125_bn_leaky_split_3 20_152 -23330=4,3,8,8,1024
ConvolutionDepthWise     21_156                   1 1 20_152 21_156_bn_leaky -23330=4,3,8,8,1024 0=1024 1=3 4=1 5=1 6=9216 7=1024 9=2 -23310=1,1.000000e-01
Split                    21_156_bn_leaky_split    1 2 21_156_bn_leaky 21_156_bn_leaky_split_0 21_156_bn_leaky_split_1 -23330=8,3,8,8,1024,3,8,8,1024
Convolution              22_167                   1 1 21_156_bn_leaky_split_0 22_167_bn_leaky -23330=4,3,8,8,512 0=512 1=1 5=1 6=524288 9=2 -23310=1,1.000000e-01
Convolution              23_175                   1 1 22_167_bn_leaky 23_175 -23330=4,3,8,8,18 0=18 1=1 5=1 6=9216
ConvolutionDepthWise     26_205                   1 1 21_156_bn_leaky_split_1 26_205_bn_leaky -23330=4,3,8,8,1024 0=1024 1=3 4=1 5=1 6=9216 7=1024 9=2 -23310=1,1.000000e-01
Convolution              27_215                   1 1 26_205_bn_leaky 27_215_bn_leaky -23330=4,3,8,8,256 0=256 1=1 5=1 6=262144 9=2 -23310=1,1.000000e-01
Interp                   28_223                   1 1 27_215_bn_leaky 28_223 -23330=4,3,16,16,256 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   29_226                   2 1 28_223 12_112_bn_leaky_split_1 29_226 -23330=4,3,16,16,512
ConvolutionDepthWise     30_229                   1 1 29_226 30_229_bn_leaky -23330=4,3,16,16,512 0=512 1=5 4=2 5=1 6=12800 7=512 9=2 -23310=1,1.000000e-01
Convolution              31_238                   1 1 30_229_bn_leaky 31_238_bn_leaky -23330=4,3,16,16,256 0=256 1=1 5=1 6=131072 9=2 -23310=1,1.000000e-01
Split                    31_238_bn_leaky_split    1 2 31_238_bn_leaky 31_238_bn_leaky_split_0 31_238_bn_leaky_split_1 -23330=8,3,16,16,256,3,16,16,256
Convolution              32_246                   1 1 31_238_bn_leaky_split_0 32_246 -23330=4,3,16,16,18 0=18 1=1 5=1 6=4608
ConvolutionDepthWise     35_276                   1 1 31_238_bn_leaky_split_1 35_276_bn_leaky -23330=4,3,16,16,256 0=256 1=3 4=1 5=1 6=2304 7=256 9=2 -23310=1,1.000000e-01
Convolution              36_286                   1 1 35_276_bn_leaky 36_286_bn_leaky -23330=4,3,16,16,128 0=128 1=1 5=1 6=32768 9=2 -23310=1,1.000000e-01
Interp                   37_294                   1 1 36_286_bn_leaky 37_294 -23330=4,3,32,32,128 0=1 1=2.000000e+00 2=2.000000e+00
Concat                   38_297                   2 1 37_294 9_90_bn_leaky_split_1 38_297 -23330=4,3,32,32,256
ConvolutionDepthWise     39_300                   1 1 38_297 39_300_bn_leaky -23330=4,3,32,32,256 0=256 1=5 4=2 5=1 6=6400 7=256 9=2 -23310=1,1.000000e-01
Convolution              40_309                   1 1 39_300_bn_leaky 40_309_bn_leaky -23330=4,3,32,32,128 0=128 1=1 5=1 6=32768 9=2 -23310=1,1.000000e-01
Convolution              41_317                   1 1 40_309_bn_leaky 41_317 -23330=4,3,32,32,18 0=18 1=1 5=1 6=2304
Yolov3DetectionOutput    detection_out            3 1 23_175 32_246 41_317 output -23330=4,2,6,866,1 0=1 1=3 2=2.500000e-01 -23304=18,5.000000e+00,7.000000e+00,9.000000e+00,1.200000e+01,1.600000e+01,2.000000e+01,2.900000e+01,2.400000e+01,2.300000e+01,3.700000e+01,2.900000e+01,7.200000e+01,5.000000e+01,4.800000e+01,6.000000e+01,1.010000e+02,1.160000e+02,1.470000e+02 -23305=9,1086324736,1088421888,1090519040,1077936128,1082130432,1084227584,0,1065353216,1073741824 -23306=3,3.360000e+01,1.680000e+01,8.400000e+00
